app/controllers/home_controller.rb

  def index
    @hackers_all = Hacker.where.not(level: 0)
    @pagoda_all = Pagoda.where.not(level: 0)
    @young_all = Young.where.not(level: 0)
---
SELECT "hackers".* FROM "hackers" WHERE ("hackers"."level" != ?)  [["level", 0]]
SELECT "pagodas".* FROM "pagodas" WHERE ("pagodas"."level" != ?)  [["level", 0]]
SELECT "youngs".* FROM "youngs" WHERE ("youngs"."level" != ?)  [["level", 0]]

  def index_result

    @filtered_hackers = Hacker.where("subject In (?) and loc In (?) and week In (?) and level In (?)",
    params[:subject], params[:loc], params[:week], params[:level])

    @filtered_pagoda = Pagoda.where("subject In (?) and loc In (?) and week In (?) and level In (?)",
    params[:subject], params[:loc], params[:week], params[:level])

    @filtered_young = Young.where("subject In (?) and loc In (?) and week In (?) and level In (?)",
    params[:subject], params[:loc], params[:week], params[:level])

    @hackers_all = Hacker.where.not(level: 0)
    @pagoda_all = Pagoda.where.not(level: 0)
    @young_all = Young.where.not(level: 0)

    @hackers_num = Hacker.where.not(level: 0).length
---
SELECT "hackers".* FROM "hackers" WHERE (subject In ('1') and loc In ('1') and week In ('1') and level In ('3'))
SELECT "pagodas".* FROM "pagodas" WHERE (subject In ('1') and loc In ('1') and week In ('1') and level In ('3'))
SELECT "youngs".* FROM "youngs" WHERE (subject In ('1') and loc In ('1') and week In ('1') and level In ('3'))
SELECT COUNT(*) FROM "hackers" WHERE (subject In ('1') and loc In ('1') and week In ('1') and level In ('3'))